---
kind: type
id: T:Autodesk.Revit.DB.DirectContext3D.VertexBuffer
source: html/329e5617-ce46-a993-1131-85c64f0842f2.htm
---
# Autodesk.Revit.DB.DirectContext3D.VertexBuffer

A buffer that stores vertex data for rendering.

## Syntax (C#)
```csharp
public class VertexBuffer : IDisposable
```